Here's the `terraform plan`:

```
$ cd ops/terraform/env/prod/stateful/
$ terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.stateful.module.admin.data.aws_caller_identity.current: Refreshing state...
module.stateful.module.logs.data.aws_caller_identity.current: Refreshing state...
module.stateful.aws_sns_topic.cloudwatch_alarms: Refreshing state... [id=arn:aws:sns:us-east-1:577373831711:bfd-prod-cloudwatch-alarms]
module.stateful.data.aws_security_group.tools: Refreshing state...
module.stateful.aws_sns_topic.cloudwatch_ok: Refreshing state... [id=arn:aws:sns:us-east-1:577373831711:bfd-prod-cloudwatch-ok]
module.stateful.module.replica3.data.aws_iam_role.rds_monitoring: Refreshing state...
module.stateful.data.aws_security_group.vpn: Refreshing state...
module.stateful.module.elb.aws_s3_bucket.main: Refreshing state... [id=bfd-prod-elb-577373831711]
module.stateful.module.etl.data.aws_caller_identity.current: Refreshing state...
module.stateful.data.aws_vpc.main: Refreshing state...
module.stateful.module.replica2.data.aws_iam_role.rds_monitoring: Refreshing state...
module.stateful.module.master.data.aws_iam_role.rds_monitoring: Refreshing state...
module.stateful.data.aws_kms_key.master_key: Refreshing state...
module.stateful.module.replica1.data.aws_iam_role.rds_monitoring: Refreshing state...
module.stateful.data.aws_security_group.management: Refreshing state...
module.stateful.data.aws_subnet.data_subnets[0]: Refreshing state...
module.stateful.data.aws_subnet.data_subnets[2]: Refreshing state...
module.stateful.data.aws_subnet.data_subnets[1]: Refreshing state...
module.stateful.module.local_zone.aws_route53_zone.main: Refreshing state... [id=Z0273533JQSRTP0OEGN6]
module.stateful.aws_db_parameter_group.default_mode: Refreshing state... [id=bfd-prod-default-mode-parameter-group]
module.stateful.aws_iam_user.etl: Refreshing state... [id=bfd-prod-etl]
module.stateful.aws_db_parameter_group.import_mode: Refreshing state... [id=bfd-prod-import-mode-parameter-group]
module.stateful.aws_security_group.db: Refreshing state... [id=sg-054d0623e58df94de]
module.stateful.aws_security_group.master_db: Refreshing state... [id=sg-0c86a4b1fdd035130]
module.stateful.aws_db_subnet_group.db: Refreshing state... [id=bfd-prod-subnet-group]
module.stateful.module.admin.aws_s3_bucket.main: Refreshing state... [id=bfd-prod-admin-577373831711]
module.stateful.module.etl.aws_s3_bucket.main: Refreshing state... [id=bfd-prod-etl-577373831711]
module.stateful.aws_security_group_rule.allow_master_access: Refreshing state... [id=sgrule-3143113278]
module.stateful.module.master.aws_db_instance.db: Refreshing state... [id=bfd-prod-master]
module.stateful.module.master.aws_route53_record.db: Refreshing state... [id=Z0273533JQSRTP0OEGN6_master_CNAME]
module.stateful.module.master_alarms.aws_cloudwatch_metric_alarm.rds_free_storage[0]: Refreshing state... [id=bfd-prod-master-rds-free-storage]
module.stateful.module.master_alarms.aws_cloudwatch_metric_alarm.rds_disk_queue_depth[0]: Refreshing state... [id=bfd-prod-master-rds-disk-queue-depth]
module.stateful.module.master_alarms.aws_cloudwatch_metric_alarm.rds_write_latency[0]: Refreshing state... [id=bfd-prod-master-rds-write-latency]
module.stateful.module.replica3.aws_db_instance.db: Refreshing state... [id=bfd-prod-replica3]
module.stateful.module.replica1.aws_db_instance.db: Refreshing state... [id=bfd-prod-replica1]
module.stateful.module.replica2.aws_db_instance.db: Refreshing state... [id=bfd-prod-replica2]
module.stateful.aws_iam_policy.etl_rw_s3: Refreshing state... [id=arn:aws:iam::577373831711:policy/bfd-prod-etl-rw-s3]
module.stateful.module.replica2.aws_route53_record.db: Refreshing state... [id=Z0273533JQSRTP0OEGN6_replica2_CNAME]
module.stateful.module.replica2_alarms.aws_cloudwatch_metric_alarm.rds_read_latency[0]: Refreshing state... [id=bfd-prod-replica2-rds-read-latency]
module.stateful.module.replica2_alarms.aws_cloudwatch_metric_alarm.rds_replica_lag[0]: Refreshing state... [id=bfd-prod-replica2-rds-replica-lag]
module.stateful.module.replica2_alarms.aws_cloudwatch_metric_alarm.rds_disk_queue_depth[0]: Refreshing state... [id=bfd-prod-replica2-rds-disk-queue-depth]
module.stateful.module.replica3.aws_route53_record.db: Refreshing state... [id=Z0273533JQSRTP0OEGN6_replica3_CNAME]
module.stateful.module.replica3_alarms.aws_cloudwatch_metric_alarm.rds_replica_lag[0]: Refreshing state... [id=bfd-prod-replica3-rds-replica-lag]
module.stateful.module.replica3_alarms.aws_cloudwatch_metric_alarm.rds_read_latency[0]: Refreshing state... [id=bfd-prod-replica3-rds-read-latency]
module.stateful.module.replica1.aws_route53_record.db: Refreshing state... [id=Z0273533JQSRTP0OEGN6_replica1_CNAME]
module.stateful.module.replica3_alarms.aws_cloudwatch_metric_alarm.rds_disk_queue_depth[0]: Refreshing state... [id=bfd-prod-replica3-rds-disk-queue-depth]
module.stateful.aws_iam_user_policy_attachment.etl_rw_s3: Refreshing state... [id=bfd-prod-etl-20190927194226689900000001]
module.stateful.module.replica1_alarms.aws_cloudwatch_metric_alarm.rds_replica_lag[0]: Refreshing state... [id=bfd-prod-replica1-rds-replica-lag]
module.stateful.module.replica1_alarms.aws_cloudwatch_metric_alarm.rds_disk_queue_depth[0]: Refreshing state... [id=bfd-prod-replica1-rds-disk-queue-depth]
module.stateful.module.replica1_alarms.aws_cloudwatch_metric_alarm.rds_read_latency[0]: Refreshing state... [id=bfd-prod-replica1-rds-read-latency]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.stateful.aws_sns_topic_subscription.alarm[0] will be created
  + resource "aws_sns_topic_subscription" "alarm" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + endpoint                        = "https://alert.victorops.com/integrations/cloudwatch/20131130/alert/55e5f15e-cd33-4790-919e-1ce13a2d8299/CCS"
      + endpoint_auto_confirms          = true
      + id                              = (known after apply)
      + protocol                        = "https"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:us-east-1:577373831711:bfd-prod-cloudwatch-alarms"
    }

  # module.stateful.aws_sns_topic_subscription.ok[0] will be created
  + resource "aws_sns_topic_subscription" "ok" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + endpoint                        = "https://alert.victorops.com/integrations/cloudwatch/20131130/alert/55e5f15e-cd33-4790-919e-1ce13a2d8299/CCS"
      + endpoint_auto_confirms          = true
      + id                              = (known after apply)
      + protocol                        = "https"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:us-east-1:577373831711:bfd-prod-cloudwatch-ok"
    }

  # module.stateful.module.admin.aws_s3_bucket.main will be updated in-place
  ~ resource "aws_s3_bucket" "main" {
      ~ acl                         = "log-delivery-write" -> "private"
        arn                         = "arn:aws:s3:::bfd-prod-admin-577373831711"
        bucket                      = "bfd-prod-admin-577373831711"
        bucket_domain_name          = "bfd-prod-admin-577373831711.s3.amazonaws.com"
        bucket_regional_domain_name = "bfd-prod-admin-577373831711.s3.amazonaws.com"
        force_destroy               = false
        hosted_zone_id              = "Z3AQBSTGFYJSTF"
        id                          = "bfd-prod-admin-577373831711"
        region                      = "us-east-1"
        request_payer               = "BucketOwner"
        tags                        = {
            "Environment" = "prod"
            "Layer"       = "data"
            "application" = "bfd"
            "business"    = "oeda"
            "role"        = "admin"
            "stack"       = "prod"
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

        server_side_encryption_configuration {
            rule {
                apply_server_side_encryption_by_default {
                    kms_master_key_id = "arn:aws:kms:us-east-1:577373831711:key/82901607-504c-40b0-85bc-3be929ca10e6"
                    sse_algorithm     = "aws:kms"
                }
            }
        }

        versioning {
            enabled    = false
            mfa_delete = false
        }
    }

  # module.stateful.module.admin.aws_s3_bucket_public_access_block.main will be created
  + resource "aws_s3_bucket_public_access_block" "main" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "bfd-prod-admin-577373831711"
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # module.stateful.module.elb.aws_s3_bucket.main will be destroyed
  - resource "aws_s3_bucket" "main" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::bfd-prod-elb-577373831711" -> null
      - bucket                      = "bfd-prod-elb-577373831711" -> null
      - bucket_domain_name          = "bfd-prod-elb-577373831711.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "bfd-prod-elb-577373831711.s3.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
      - id                          = "bfd-prod-elb-577373831711" -> null
      - region                      = "us-east-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "Environment" = "prod"
          - "Layer"       = "data"
          - "application" = "bfd"
          - "business"    = "oeda"
          - "role"        = "elb"
          - "stack"       = "prod"
        } -> null

      - server_side_encryption_configuration {
          - rule {
              - apply_server_side_encryption_by_default {
                  - kms_master_key_id = "arn:aws:kms:us-east-1:577373831711:key/82901607-504c-40b0-85bc-3be929ca10e6" -> null
                  - sse_algorithm     = "aws:kms" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.stateful.module.etl.aws_s3_bucket.main will be updated in-place
  ~ resource "aws_s3_bucket" "main" {
        acl                         = "private"
        arn                         = "arn:aws:s3:::bfd-prod-etl-577373831711"
        bucket                      = "bfd-prod-etl-577373831711"
        bucket_domain_name          = "bfd-prod-etl-577373831711.s3.amazonaws.com"
        bucket_regional_domain_name = "bfd-prod-etl-577373831711.s3.amazonaws.com"
        force_destroy               = false
        hosted_zone_id              = "Z3AQBSTGFYJSTF"
        id                          = "bfd-prod-etl-577373831711"
        region                      = "us-east-1"
        request_payer               = "BucketOwner"
        tags                        = {
            "Environment" = "prod"
            "Layer"       = "data"
            "application" = "bfd"
            "business"    = "oeda"
            "role"        = "etl"
            "stack"       = "prod"
        }

      - logging {
          - target_bucket = "bfd-prod-admin-577373831711" -> null
          - target_prefix = "logs/etl" -> null
        }
      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

        server_side_encryption_configuration {
            rule {
                apply_server_side_encryption_by_default {
                    kms_master_key_id = "arn:aws:kms:us-east-1:577373831711:key/82901607-504c-40b0-85bc-3be929ca10e6"
                    sse_algorithm     = "aws:kms"
                }
            }
        }

        versioning {
            enabled    = false
            mfa_delete = false
        }
    }

  # module.stateful.module.etl.aws_s3_bucket_public_access_block.main will be created
  + resource "aws_s3_bucket_public_access_block" "main" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "bfd-prod-etl-577373831711"
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # module.stateful.module.logs.aws_s3_bucket.main will be created
  + resource "aws_s3_bucket" "main" {
      + acceleration_status         = (known after apply)
      + acl                         = "log-delivery-write"
      + arn                         = (known after apply)
      + bucket                      = "bfd-prod-logs-577373831711"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "prod"
          + "Layer"       = "data"
          + "application" = "bfd"
          + "business"    = "oeda"
          + "role"        = "logs"
          + "stack"       = "prod"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.stateful.module.logs.aws_s3_bucket_public_access_block.main will be created
  + resource "aws_s3_bucket_public_access_block" "main" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # module.stateful.module.master.aws_db_instance.db will be updated in-place
  ~ resource "aws_db_instance" "db" {
        address                               = "bfd-prod-master.clyryngdhnko.us-east-1.rds.amazonaws.com"
        allocated_storage                     = 16000
        apply_immediately                     = false
        arn                                   = "arn:aws:rds:us-east-1:577373831711:db:bfd-prod-master"
        auto_minor_version_upgrade            = true
        availability_zone                     = "us-east-1b"
        backup_retention_period               = 21
        backup_window                         = "05:00-06:00"
        ca_cert_identifier                    = "rds-ca-2015"
        copy_tags_to_snapshot                 = true
        db_subnet_group_name                  = "bfd-prod-subnet-group"
        deletion_protection                   = true
        enabled_cloudwatch_logs_exports       = [
            "postgresql",
            "upgrade",
        ]
        endpoint                              = "bfd-prod-master.clyryngdhnko.us-east-1.rds.amazonaws.com:5432"
        engine                                = "postgres"
        engine_version                        = "9.6.11"
        final_snapshot_identifier             = "bfd-prod-master-final"
        hosted_zone_id                        = "Z2R2ITUGPM61AM"
        iam_database_authentication_enabled   = false
        id                                    = "bfd-prod-master"
        identifier                            = "bfd-prod-master"
        instance_class                        = "db.r5.24xlarge"
      ~ iops                                  = 16000 -> 80000
        kms_key_id                            = "arn:aws:kms:us-east-1:577373831711:key/82901607-504c-40b0-85bc-3be929ca10e6"
        license_model                         = "postgresql-license"
        maintenance_window                    = "fri:07:00-fri:08:00"
        max_allocated_storage                 = 0
        monitoring_interval                   = 15
        monitoring_role_arn                   = "arn:aws:iam::577373831711:role/rds-monitoring-role"
        multi_az                              = false
        name                                  = "bfdtemp"
        option_group_name                     = "default:postgres-9-6"
        parameter_group_name                  = "bfd-prod-default-mode-parameter-group"
        password                              = (sensitive value)
        performance_insights_enabled          = false
        performance_insights_retention_period = 0
        port                                  = 5432
        publicly_accessible                   = false
        replicas                              = [
            "bfd-prod-replica2",
            "bfd-prod-replica3",
            "bfd-prod-replica1",
        ]
        resource_id                           = "db-7V7HUAVDF5JP5W5S3APVNN4WDA"
        security_group_names                  = []
        skip_final_snapshot                   = false
        status                                = "available"
        storage_encrypted                     = true
        storage_type                          = "io1"
        tags                                  = {
            "Environment" = "prod"
            "Layer"       = "data"
            "application" = "bfd"
            "business"    = "oeda"
            "role"        = "master"
            "stack"       = "prod"
        }
        username                              = "bfduser"
        vpc_security_group_ids                = [
            "sg-0a2fb33487c23a233",
            "sg-0a6734c1551266727",
            "sg-0aee7caa9ab3c0914",
            "sg-0c86a4b1fdd035130",
        ]
    }

  # module.stateful.module.replica1.aws_db_instance.db will be updated in-place
  ~ resource "aws_db_instance" "db" {
        address                               = "bfd-prod-replica1.clyryngdhnko.us-east-1.rds.amazonaws.com"
        allocated_storage                     = 16000
        apply_immediately                     = false
        arn                                   = "arn:aws:rds:us-east-1:577373831711:db:bfd-prod-replica1"
        auto_minor_version_upgrade            = true
        availability_zone                     = "us-east-1a"
        backup_retention_period               = 0
        backup_window                         = "05:00-06:00"
        ca_cert_identifier                    = "rds-ca-2015"
        copy_tags_to_snapshot                 = true
        db_subnet_group_name                  = "bfd-prod-subnet-group"
        deletion_protection                   = true
        enabled_cloudwatch_logs_exports       = [
            "postgresql",
            "upgrade",
        ]
        endpoint                              = "bfd-prod-replica1.clyryngdhnko.us-east-1.rds.amazonaws.com:5432"
        engine                                = "postgres"
        engine_version                        = "9.6.11"
        final_snapshot_identifier             = "bfd-prod-replica1-final"
        hosted_zone_id                        = "Z2R2ITUGPM61AM"
        iam_database_authentication_enabled   = false
        id                                    = "bfd-prod-replica1"
        identifier                            = "bfd-prod-replica1"
        instance_class                        = "db.r5.24xlarge"
      ~ iops                                  = 16000 -> 80000
        kms_key_id                            = "arn:aws:kms:us-east-1:577373831711:key/82901607-504c-40b0-85bc-3be929ca10e6"
        license_model                         = "postgresql-license"
        maintenance_window                    = "fri:07:00-fri:08:00"
        max_allocated_storage                 = 0
        monitoring_interval                   = 15
        monitoring_role_arn                   = "arn:aws:iam::577373831711:role/rds-monitoring-role"
        multi_az                              = false
        name                                  = "bfdtemp"
        option_group_name                     = "default:postgres-9-6"
        parameter_group_name                  = "bfd-prod-default-mode-parameter-group"
        performance_insights_enabled          = false
        performance_insights_retention_period = 0
        port                                  = 5432
        publicly_accessible                   = false
        replicas                              = []
        replicate_source_db                   = "bfd-prod-master"
        resource_id                           = "db-M736V6Y7WBRSRAGQ6WU22YRCG4"
        security_group_names                  = []
        skip_final_snapshot                   = false
        status                                = "available"
        storage_encrypted                     = true
        storage_type                          = "io1"
        tags                                  = {
            "Environment" = "prod"
            "Layer"       = "data"
            "application" = "bfd"
            "business"    = "oeda"
            "role"        = "replica1"
            "stack"       = "prod"
        }
        username                              = "bfduser"
        vpc_security_group_ids                = [
            "sg-054d0623e58df94de",
            "sg-0a2fb33487c23a233",
            "sg-0a6734c1551266727",
            "sg-0aee7caa9ab3c0914",
        ]
    }

  # module.stateful.module.replica2.aws_db_instance.db will be updated in-place
  ~ resource "aws_db_instance" "db" {
        address                               = "bfd-prod-replica2.clyryngdhnko.us-east-1.rds.amazonaws.com"
        allocated_storage                     = 16000
        apply_immediately                     = false
        arn                                   = "arn:aws:rds:us-east-1:577373831711:db:bfd-prod-replica2"
        auto_minor_version_upgrade            = true
        availability_zone                     = "us-east-1b"
        backup_retention_period               = 0
        backup_window                         = "05:00-06:00"
        ca_cert_identifier                    = "rds-ca-2015"
        copy_tags_to_snapshot                 = true
        db_subnet_group_name                  = "bfd-prod-subnet-group"
        deletion_protection                   = true
        enabled_cloudwatch_logs_exports       = [
            "postgresql",
            "upgrade",
        ]
        endpoint                              = "bfd-prod-replica2.clyryngdhnko.us-east-1.rds.amazonaws.com:5432"
        engine                                = "postgres"
        engine_version                        = "9.6.11"
        final_snapshot_identifier             = "bfd-prod-replica2-final"
        hosted_zone_id                        = "Z2R2ITUGPM61AM"
        iam_database_authentication_enabled   = false
        id                                    = "bfd-prod-replica2"
        identifier                            = "bfd-prod-replica2"
        instance_class                        = "db.r5.24xlarge"
      ~ iops                                  = 16000 -> 80000
        kms_key_id                            = "arn:aws:kms:us-east-1:577373831711:key/82901607-504c-40b0-85bc-3be929ca10e6"
        license_model                         = "postgresql-license"
        maintenance_window                    = "fri:07:00-fri:08:00"
        max_allocated_storage                 = 0
        monitoring_interval                   = 15
        monitoring_role_arn                   = "arn:aws:iam::577373831711:role/rds-monitoring-role"
        multi_az                              = false
        name                                  = "bfdtemp"
        option_group_name                     = "default:postgres-9-6"
        parameter_group_name                  = "bfd-prod-default-mode-parameter-group"
        performance_insights_enabled          = false
        performance_insights_retention_period = 0
        port                                  = 5432
        publicly_accessible                   = false
        replicas                              = []
        replicate_source_db                   = "bfd-prod-master"
        resource_id                           = "db-36LTZ4USZTY2ATGZCVYHJ6P7YU"
        security_group_names                  = []
        skip_final_snapshot                   = false
        status                                = "available"
        storage_encrypted                     = true
        storage_type                          = "io1"
        tags                                  = {
            "Environment" = "prod"
            "Layer"       = "data"
            "application" = "bfd"
            "business"    = "oeda"
            "role"        = "replica2"
            "stack"       = "prod"
        }
        username                              = "bfduser"
        vpc_security_group_ids                = [
            "sg-054d0623e58df94de",
            "sg-0a2fb33487c23a233",
            "sg-0a6734c1551266727",
            "sg-0aee7caa9ab3c0914",
        ]
    }

  # module.stateful.module.replica3.aws_db_instance.db will be updated in-place
  ~ resource "aws_db_instance" "db" {
        address                               = "bfd-prod-replica3.clyryngdhnko.us-east-1.rds.amazonaws.com"
        allocated_storage                     = 16000
        apply_immediately                     = false
        arn                                   = "arn:aws:rds:us-east-1:577373831711:db:bfd-prod-replica3"
        auto_minor_version_upgrade            = true
        availability_zone                     = "us-east-1c"
        backup_retention_period               = 0
        backup_window                         = "05:00-06:00"
        ca_cert_identifier                    = "rds-ca-2015"
        copy_tags_to_snapshot                 = true
        db_subnet_group_name                  = "bfd-prod-subnet-group"
        deletion_protection                   = true
        enabled_cloudwatch_logs_exports       = [
            "postgresql",
            "upgrade",
        ]
        endpoint                              = "bfd-prod-replica3.clyryngdhnko.us-east-1.rds.amazonaws.com:5432"
        engine                                = "postgres"
        engine_version                        = "9.6.11"
        final_snapshot_identifier             = "bfd-prod-replica3-final"
        hosted_zone_id                        = "Z2R2ITUGPM61AM"
        iam_database_authentication_enabled   = false
        id                                    = "bfd-prod-replica3"
        identifier                            = "bfd-prod-replica3"
        instance_class                        = "db.r5.24xlarge"
      ~ iops                                  = 16000 -> 80000
        kms_key_id                            = "arn:aws:kms:us-east-1:577373831711:key/82901607-504c-40b0-85bc-3be929ca10e6"
        license_model                         = "postgresql-license"
        maintenance_window                    = "fri:07:00-fri:08:00"
        max_allocated_storage                 = 0
        monitoring_interval                   = 15
        monitoring_role_arn                   = "arn:aws:iam::577373831711:role/rds-monitoring-role"
        multi_az                              = false
        name                                  = "bfdtemp"
        option_group_name                     = "default:postgres-9-6"
        parameter_group_name                  = "bfd-prod-default-mode-parameter-group"
        performance_insights_enabled          = false
        performance_insights_retention_period = 0
        port                                  = 5432
        publicly_accessible                   = false
        replicas                              = []
        replicate_source_db                   = "bfd-prod-master"
        resource_id                           = "db-XBXMSXOJFJFWIUKWTADYPKG6JE"
        security_group_names                  = []
        skip_final_snapshot                   = false
        status                                = "available"
        storage_encrypted                     = true
        storage_type                          = "io1"
        tags                                  = {
            "Environment" = "prod"
            "Layer"       = "data"
            "application" = "bfd"
            "business"    = "oeda"
            "role"        = "replica3"
            "stack"       = "prod"
        }
        username                              = "bfduser"
        vpc_security_group_ids                = [
            "sg-054d0623e58df94de",
            "sg-0a2fb33487c23a233",
            "sg-0a6734c1551266727",
            "sg-0aee7caa9ab3c0914",
        ]
    }

Plan: 6 to add, 6 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

Releasing state lock. This may take a few moments...
```

Note that it's been a while since prod's stateful plan was applied.